schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
exit:
    SerialPrintfln("Playlist:    " ANSI_ESC_BLUE "end of playlist");
    webSrv.send("SD_playFile=", "end of playlist");
    _f_playlistEnabled = false;
    _playerSubMenue = 0;
    changeState(PLAYER);
    _plsCurPos = 0;
    x_ps_free(&playFile);
    x_ps_free(&duration);
    x_ps_free(&title);
    x_ps_free(&plsContent);
    x_ps_free(&plsExtension);
    x_ps_free(&_playlistPath);
    return;
}
/*****************************************************************************************************************************************************
 *                                         C O N N E C T   TO   W I F I     /     A C C E S S P O I N T                                              *
 *****************************************************************************************************************************************************/
bool connectToWiFi() {

    char* line = x_ps_malloc(512);
    uint16_t idx = 0;
    wifiMulti.addAP(_SSID, _PW);                        // SSID and PW in code
    SerialPrintfln("WiFI_info:   add SSID: " ANSI_ESC_CYAN "%s", _SSID);

    if(pref.isKey("ap_ssid") && pref.isKey("ap_pw")) {  // exists?
        String ap_ssid = pref.getString("ap_ssid", ""); // credentials from accesspoint
        String ap_pw = pref.getString("ap_pw", "");
        if(ap_ssid.length() > 0 && ap_pw.length() > 0) wifiMulti.addAP(ap_ssid.c_str(), ap_pw.c_str());
        SerialPrintfln("WiFI_info:   add SSID: " ANSI_ESC_CYAN "%s", ap_ssid.c_str());
    }

    File file = SD_MMC.open("/networks.csv"); // try credentials given in "/networks.txt"
    if(file) {                                // try to read from SD_MMC
        while(file.available()) {
            char emptyStr[1] = "";
            char* s_ssid = emptyStr;
            char* s_password = emptyStr;
            char* s_info = emptyStr;
            idx = file.readBytesUntil('\n', line, 512);     // read the line
            if(idx == 0) break;
            line[idx] = '\0';                               // terminate the line
            if(line[0] == '*') continue;                    // ignore this, goto next line
            if(line[0] == '\n') continue;                   // empty line
            if(line[0] == ' ') continue;                    // space as first char

            uint8_t p = 0;
            uint16_t slen = strlen(line);
            for(int16_t i = 0; i < slen; i++) {
                if(line[i] == '\n') {                       // make LF ineffective
                    line[i] = '\0';
                    continue;
                }
                if(i == 0) s_ssid = line;                   // string at pos 0 is ssid
                if(line[i] == '\t') {
                    line[i] = '\0';
                    if(p == 0) {s_password = line + i + 1;} // string after first tab is passwort (if available)
                    if(p == 1) {    s_info = line + i + 1;} // string after second tab is info (if available)
                    p++;
                }
            }
            if(strlen(s_ssid) == 0) continue;               // ssid is empty
        //    log_i("%s, %s, %s",  s_ssid, s_password, s_info);
            wifiMulti.addAP(s_ssid, s_password);
            SerialPrintfln("WiFI_info:   add SSID: " ANSI_ESC_CYAN "%s", s_ssid);
            (void) s_info; // unused
        }
        file.close();
        x_ps_free(&line);
    }
    /* int16_t n = WiFi.scanNetworks();
    SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "%i WiFi networks found", n);
    for(int i = 0; i < n; i++){
        SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
    } */
    wifiMulti.setStrictMode(true);
    wifiMulti.run();
    if(WiFi.isConnected()) {
        SerialPrintfln("WiFI_info:   Connecting WiFi...");
        if(!MDNS.begin("MiniWebRadio")) { SerialPrintfln("WiFI_info:   " ANSI_ESC_YELLOW "Error starting mDNS"); }
        else {
           MDNS.addService("esp32", "tcp", 80);
           SerialPrintfln("WiFI_info:   mDNS name: " ANSI_ESC_CYAN "MiniWebRadio");
        }
        WiFi.setAutoReconnect(true);
        if(WIFI_TX_POWER >= 2 && WIFI_TX_POWER <= 21) WiFi.setTxPower((wifi_power_t)(WIFI_TX_POWER * 4));
        return true;
    }
    else {
        WiFi.mode(WIFI_MODE_NULL);
        SerialPrintfln("WiFI_info:   " ANSI_ESC_RED "WiFi credentials are not correct");
        return false; // can't connect to any network
    }
}

void openAccessPoint() { // if credentials are not correct open AP at 192.168.4.1
    _f_accessPoint = true;
    char buf[200];
    int16_t n = 0, i = 0;
    n = WiFi.scanNetworks();
    while(n < 1){
        vTaskDelay(1000 / portTICK_PERIOD_MS);
        i++;
        if(i == 8) break;
    }
    if(n == 0) {
        SerialPrintfln("setup: ....  no WiFi networks found");
        tft.setFont(_fonts[4]);
        tft.setTextColor(TFT_YELLOW);
        tft.fillScreen(TFT_BLACK);
        sprintf(buf, "No WiFi networks found");
        tft.writeText(buf, 0, 0, _dispWidth, _dispHeight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, false);
        while(true) { vTaskDelay(10 / portTICK_PERIOD_MS); }
    }
    else {
        SerialPrintfln("setup: ....  %d WiFi networks found", n);
        for(int32_t i = 0; i < n; ++i) {
            SerialPrintfln("setup: ....  " ANSI_ESC_GREEN "%s (%d)", WiFi.SSID(i).c_str(), (int16_t)WiFi.RSSI(i));
            _scannedNetworks += WiFi.SSID(i) + '\n';
        }
    }

    WiFi.softAP("MiniWebRadio");
    IPAddress myIP = WiFi.softAPIP();
    String    AccesspointIP = myIP.toString();

    tft.setFont(_fonts[4]);
    tft.setTextColor(TFT_YELLOW);
    tft.fillScreen(TFT_BLACK);
    sprintf(buf, "WiFi credentials are not correct \nAccesspoint IP: " ANSI_ESC_CYAN "%s", AccesspointIP.c_str());
    tft.writeText(buf, 0, 0, _dispWidth, _dispHeight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, false);
    SerialPrintfln("Accesspoint: " ANSI_ESC_RED "IP: %s", AccesspointIP.c_str());

    webSrv.begin(80, 81); // HTTP port, WebSocket port
    return;
}

