schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(_state == RADIO) {
        if( val && !strcmp(name, "btn_RA_mute"))     {setTimeCounter(2); {if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && !strcmp(name, "btn_RA_prevSta"))  {setTimeCounter(2); return;}
        if( val && !strcmp(name, "btn_RA_nextSta"))  {setTimeCounter(2); return;}
        if( val && !strcmp(name, "btn_RA_staList"))  {return;}
        if( val && !strcmp(name, "btn_RA_player"))   {return;}
        if( val && !strcmp(name, "btn_RA_dlna"))     {return;}
        if( val && !strcmp(name, "btn_RA_clock"))    {return;}
        if( val && !strcmp(name, "btn_RA_sleep"))    {return;}
        if( val && !strcmp(name, "btn_RA_bright"))   {return;}
        if(!val && !strcmp(name, "btn_RA_bright"))   {setTimeCounter(2); return;}
        if( val && !strcmp(name, "btn_RA_equal"))    {return;}
        if( val && !strcmp(name, "btn_RA_bt"))       {return;}
        if(!val && !strcmp(name, "btn_RA_bt"))       {setTimeCounter(2); return;}
        if( val && !strcmp(name, "btn_RA_off"))      {return;}
        if( val && !strcmp(name, "VUmeter_RA"))      {return;}
    }
    if(_state == STATIONSLIST) {
        if( val && !strcmp(name, "lst_RADIO"))       {setTimeCounter(4); return;}
    }
    if(_state == PLAYER) {
        if( val && !strcmp(name, "btn_PL_mute"))     {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && !strcmp(name, "btn_PL_pause"))    {return;}
        if( val && !strcmp(name, "btn_PL_cancel"))   {return;}
        if( val && !strcmp(name, "btn_PL_prevFile")) {if(_cur_AudioFileNr > 0) {_cur_AudioFileNr--; showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && !strcmp(name, "btn_PL_nextFile")) {if(_cur_AudioFileNr + 1 < _SD_content.getSize()) {_cur_AudioFileNr++; showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); showAudioFileNumber();} return;}
        if( val && !strcmp(name, "btn_PL_ready"))    {return;}
        if( val && !strcmp(name, "btn_PL_playAll"))  {return;}
        if( val && !strcmp(name, "btn_PL_shuffle"))  {return;}
        if( val && !strcmp(name, "btn_PL_fileList")) {return;}
        if( val && !strcmp(name, "btn_PL_radio"))    {return;}
        if( val && !strcmp(name, "btn_PL_off"))      {return;}
        if( val && !strcmp(name, "btn_PL_playPrev")) {_cur_AudioFileNr = _SD_content.getPrevAudioFile(_cur_AudioFileNr); return;}
        if( val && !strcmp(name, "btn_PL_playNext")) {_cur_AudioFileNr = _SD_content.getNextAudioFile(_cur_AudioFileNr); return;}
        if( val && !strcmp(name, "pgb_PL_progress")) {return;}
    }
    if(_state == AUDIOFILESLIST) {
        if( val && !strcmp(name, "lst_PLAYER"))      {setTimeCounter(4); return;}
    }
    if(_state == DLNA) {
        if( val && !strcmp(name, "btn_DL_mute"))     {{if(!_f_mute) _f_muteIsPressed = true;} return;}
        if( val && !strcmp(name, "btn_DL_pause"))    {return;}
        if( val && !strcmp(name, "btn_DL_radio"))    {return;}
        if( val && !strcmp(name, "btn_DL_fileList")) {return;}
        if( val && !strcmp(name, "btn_DL_cancel"))   {clearStationName(); btn_DL_pause.setActive(false); return;}
    }
    if(_state == DLNAITEMSLIST) {
        if( val && !strcmp(name, "lst_DLNA"))        {setTimeCounter(15); _f_dlnaWaitForResponse = true; return;}
    }
    if(_state == CLOCK) {
        if( val && !strcmp(name, "btn_CL_mute"))     {setTimeCounter(2); if(!_f_mute){ _f_muteIsPressed = true;} return;}
        if( val && !strcmp(name, "btn_CL_alarm"))    {return;}
        if( val && !strcmp(name, "btn_CL_radio"))    {return;}
        if( val && !strcmp(name, "clk_CL_12"))       {return;}
        if( val && !strcmp(name, "clk_CL_24"))       {return;}
        if( val && !strcmp(name, "btn_CL_off"))      {return;}
    }
    if(_state == ALARM) {
        if( val && !strcmp(name, "clk_AL_red"))      {return;}
        if( val && !strcmp(name, "btn_AL_left"))     {return;}
        if( val && !strcmp(name, "btn_AL_right"))    {return;}
        if( val && !strcmp(name, "btn_AL_up"))       {return;}
        if( val && !strcmp(name, "btn_AL_down"))     {return;}
        if( val && !strcmp(name, "btn_AL_ready"))    {return;}
    }
    if(_state == SLEEPTIMER) {
        if( val && !strcmp(name, "btn_SL_up"))       {return;}
        if( val && !strcmp(name, "btn_SL_down"))     {return;}
        if( val && !strcmp(name, "btn_SL_ready"))    {return;}
        if( val && !strcmp(name, "btn_SL_cancel"))   {return;}
    }
    if(_state == SETTINGS) {
        if( val && !strcmp(name, "btn_SE_bright"))   {return;}
        if( val && !strcmp(name, "btn_SE_equal"))    {return;}
        if( val && !strcmp(name, "btn_SE_wifi"))    {return;}
        if( val && !strcmp(name, "btn_SE_radio"))    {return;}
    }
    if(_state == BRIGHTNESS){
        if( val && !strcmp(name, "btn_BR_ready"))    {return;}
        if( val && !strcmp(name, "pic_BR_logo"))     {return;}
    }
    if(_state == EQUALIZER) {
        if( val && !strcmp(name, "btn_E_LP"))        {sdr_EQ_lowPass.setValue(0);  return;}
        if( val && !strcmp(name, "btn_E_BP"))        {sdr_EQ_bandPass.setValue(0); return;}
        if( val && !strcmp(name, "btn_E_HP"))        {sdr_EQ_highPass.setValue(0); return;}
        if( val && !strcmp(name, "btn_E_BAL"))       {sdr_EQ_balance.setValue(0);  return;}
        if( val && !strcmp(name, "btn_EQ_Radio"))    {return;}
        if( val && !strcmp(name, "btn_EQ_Player"))   {return;}
        if( val && !strcmp(name, "btn_EQ_mute"))     {{if(!_f_mute) _f_muteIsPressed = true;} return;}
    }
    if(_state == BLUETOOTH) {
        if( val && !strcmp(name, "btn_BT_pause"))    {bt_emitter.pauseResume(); return;}
        if( val && !strcmp(name, "btn_BT_radio"))    {return;}
        if( val && !strcmp(name, "btn_BT_volDown"))  {if(_BTvolume > 0)  {_BTvolume--; bt_emitter.downvolume();} return;}
        if( val && !strcmp(name, "btn_BT_volUp"))    {if(_BTvolume < 31) {_BTvolume++; bt_emitter.upvolume();}  return;}
        if( val && !strcmp(name, "btn_BT_mode"))     {bt_emitter.changeMode(); return;}
        if( val && !strcmp(name, "btn_BT_power"))    {return;}
    }
    if(_state == IR_SETTINGS) {
        if( val && !strcmp(name, "btn_IR_radio"))    {return;}
    }
    if(_state == WIFI_SETTINGS) {
        if( val && !strcmp(name, "key_WI_input"))    {log_e("val %i", val); if(val == 13){ _radioSubMenue = 0; changeState(RADIO); return;}}
    }
    log_d("unused event: graphicObject %s was clicked", name);
}
// —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
void graphicObjects_OnRelease(const char* name, releasedArg ra) {

    // all state
        if(!strcmp(name, "dispFooter"))      {return;}

